#### SQLite in Python

In [1]:
import sqlite3

In [3]:
conn = sqlite3.connect('data/example.db')

In [6]:
c = conn.cursor()
c.execute('CREATE TABLE person(name text,address text)')
conn.commit()

OperationalError: table person already exists

In [7]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
c.fetchall()

[('person',)]

In [12]:
c.execute("INSERT INTO person VALUES('Anna Henry','Carlow')")
conn.commit()

In [13]:
c.execute("SELECT * FROM person")
c.fetchall()

[('Anna Henry', 'Carlow'), ('Anna Henry', 'Carlow')]

In [14]:
person =[('Shelby Beck', 'Tipp'),('Geoff', 'Derby'),('Terry','London')]

In [15]:
person

[('Shelby Beck', 'Tipp'), ('Geoff', 'Derby'), ('Terry', 'London')]

In [16]:
c.executemany("INSERT INTO person VALUES (?,?)", person)
conn.commit()

In [17]:
c.execute("SELECT name FROM person")
c.fetchall()

[('Anna Henry',), ('Anna Henry',), ('Shelby Beck',), ('Geoff',), ('Terry',)]

In [19]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(1, 'Anna Henry', 'Carlow'),
 (2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [22]:
c.execute("DELETE FROM person WHERE ROWID=1")
conn.commit()

In [24]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [26]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London')]

In [29]:
c.execute("INSERT INTO person VALUES('jumbo simpson','chunkyland')")
conn.commit()

In [30]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (6, 'jumbo simpson', 'chunkyland'),
 (7, 'jumbo simpson', 'chunkyland'),
 (8, 'jumbo simpson', 'chunkyland')]

In [34]:
c.execute("DELETE FROM person WHERE ROWID=8")
conn.commit()
c.execute("DELETE FROM person WHERE ROWID=7")
conn.commit()

In [35]:
c.execute("SELECT ROWID, name, address FROM person")
c.fetchall()

[(2, 'Anna Henry', 'Carlow'),
 (3, 'Shelby Beck', 'Tipp'),
 (4, 'Geoff', 'Derby'),
 (5, 'Terry', 'London'),
 (6, 'jumbo simpson', 'chunkyland')]